{
  "firstName": "Sean",
  "middleName": "Tyler",
  "lastName": "Atwell",
  "address": "128 Atwell Rd.",
  "city": "Slocomb",
  "state": "AL",
  "zip": "36375",
  "phone": "(334) 796-8921",
  "email": "sta0003@auburn.edu",
  "education": [
    {
      "title": "Bachelors of Electrical Engineering (B.E.E.), Computer Engineering Option - Auburn University",
      "datesWorked": "August 2010 - December 2014",
      "details": [
        "Acquired skills: C, Java, C++, Assembly, HCS12 architecture, VHDL, Wireshark, Nmap, and Metasploit",
        "Senior Design under the direction of Dr. Chwan-Hwa Wu, with a focus on computer security.  We developed a secure wrapper around a VPN Server to provide silent user authentication and attack prevention."
      ]
    },
    {
      "title": "High School Diploma - Houston Academy",
      "datesWorked": "August 2006 - May 2010",
      "details": [
        "Graduated with honors"
      ]
    }
  ],
  "experience": [
    {
      "title": "Spec III Info Tech, Auburn OIT - AU Leasing Department",
      "datesWorked": "August 2015 - Present",
      "details": [
        "Work with the AU Lease Group to develop and maintain software solutions for managing all the leased computers on Auburn's campus",
        "Manage an assigned junior developer's work on various AU Lease projects",
        "Integrate the leasing software with third party vendor  applications to collect pricing information, available products, and product information changes"
      ],
      "notableProjects": [
        "AU Lease Public - This project accepts applications for new leases.  It handles all the publicly facing portions of the leasing process including placing orders, renewing leases, and scheduling times to have a leased machine delivered.",
        "AU Lease Data - This project manages the life-cycle of machines leased on campus.  It generates all the billing documentation and end of lease information needed to correctly manage the leases."
      ]
    },
    {
      "title": "TES Software Developer, Auburn OIT - Campus Web Solutions",
      "datesWorked": "January 2015 - August 2015",
      "details": [
        "Develop software solutions for Campus Web Solutions",
        "Serve as a mentor for new developers, aiding them in learning the .NET Framework and good coding practices",
        "Provide development support on several legacy applications"
      ],
      "notableProjects": [
        "Big Testing Center Scheduler - This is an application for Testing Services that allows them to create and manage seats in their testing facilities.  I overhauled the core of this application, optimizing it to run quickly under the load it was experiencing.",
        "Veteran Swipe - A system that was developed for the Department of Veteran's Affairs.  This application allows people who want to utilize Veteran's Affairs resources to swipe their student ID cards at the front entrance.  The project then provides analytics regarding resource utilization to the Department Resource Manager.",
        "OIT Bootcamp Scheduler - This project manages all the classes that Campus Web Solutions offers each semester when they are training a new Co-op group."
      ]
    },
    {
      "title": "Programming Team Lead, TgL Communications",
      "datesWorked": "September 2012 - February 2016",
      "details": [
        "Acquired Skills:  MySQL, PHP, IIS Server, Python, RS-232 protocol, MC9090 Development, and Git",
        "Coordinate development on software projects",
        "Discuss project specifications with clients, and work with floor workers to determine what was needed for a given project",
        "Lead a team of up to four software developers"
      ],
      "notableProjects": [
        "JFA Function Tester Monitor - This application prints labels for products going through a JFA function tester, then keeps track of data about that given part.  It tracks how many times it had to be run to pass inspection, as well as reasons for the failures (if any).  This project also required additions to an existing piece of Visual Basic 6 software to add networking capabilities.",
        "Inventory Manager - This application keeps track of the current inventory across several warehouses, and provides barcoded labels for ease of tracking.  This was developed in C# using the MVC3 framework.",
        "Serial Data Collector - This project pulls data from several PLC driven machines to analyze production trends.  This was developed using Python and PHP.",
        "Foam Plant Management Software - This project is used to manage product development workflow at the SCA Automotive Foam Plant.  It provides feedback to the workers to help them select the correct raw materials for a given product, and prints invoices for outgoing shipments of finished products."
      ]
    },
    {
      "title": "Co-op Web Developer, Aubur OIT - Campus Web Solutions",
      "datesWorked": "May 2012 – December 2013, August 2014 – December 2014",
      "details": [
        "Acquired Skills:  C#, MVC Framework, MS SQL, JavaScript, jQuery, CSS, and Team Foundation Server",
        "Managed several pieces of legacy code",
        "Developed new products for various campus departments",
        "Produced internal applications to improve team efficiency"
      ],
      "notableProjects": [
        "Office of Accessibility Proctored Exam Tracking System - This project allows students with disabilities to request an alternate exam time.  The test is then administered by an Office of Accessibility proctor, who will ensure that the student’s needs are met.",
        "SEND Error Tracking - This project captures errors as they occur in CWS's applications and logs them in a central database.  I also developed a front end to display relevant information and trend analysis.  This was developed in C# using the MVC3 framework.",
        "OIT Migration Tool - This project manages the code migration process for the cws.auburn.edu domain.  Applications are put onto the staging server, and this tool is used to schedule moving them to the production environment."
      ]
    }
  ],
  "technicalSkills": {
    "professionalSkills": [ "C#", "MVC Framework", "IIS Server", "MS SQL", "Team Foundation Server", "PHP", "JavaScript", "jQuery", "Git", "Angular", "MySQL", "CSS", "JSON", "WPF" ],
    "otherSkills": [ "Wireshark", "Python", "C++", "Unity development", "RS-232 protocol", "VHDL", "C", "Assembly", "Arduino development", "HCS12 architecture", "Java", "Nmap", "MC9090 development" ]
  }
}